"""
Напишите программу, которая выводит на экран сообщение Привет, Мир!
"""
print('Привет, Мир!')
