"""
02_01_A
Напишите программу, которая выводит фразу «Я стану крутым программистом!»
три раза на отдельных строках; строки должны быть именно такие, символ в символ!.
Для удобства советую поместить эту фразу в переменную и затем использовать ее при выводе.
Sample Output:
Я стану крутым программистом!
Я стану крутым программистом!
Я стану крутым программистом!
"""
S = 'Я стану крутым программистом!'
print(S, S, S, sep='\n')
