"""
02_01_D
Напишите программу, которая сначала считывает две фразы по очереди,
а потом воспроизводит их в той же последовательности, каждую на отдельной строчке.

Sample Input 1:
Hello!
Hi!
Sample Output 1:
Hello!
Hi!
"""
phrase1 = input()
phrase2 = input()
print(phrase1, phrase2, sep='\n')
