"""
02_01_H
Напишите программу, которая считывает с клавиатуры два слова
(или фразы, неважно), после чего вы должны при помощи операции
конкатенации сцепить вторую фразу с первой и вывести результат на экран.
"""
phrase1 = input()
phrase2 = input()
print(phrase2 + phrase1)
