"""
02_01_B
Напишите программу, которая напечатает строку, состоящую из 777 букв "W"
"""
print('W' * 777)

