"""
02_01_I
Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно),
после чего вывести данную строку, увеличенную по длине  в 3 раза.

Sample Input 1:
Hello
Sample Output 1:
HelloHelloHello
"""

phrase = input()
print(phrase * 3)