"""
02_07_A
Создайте этот прекрасный рисунок
Старайтесь для переноса строк использовать экранированный символ "\n"

Sample Input:
Sample Output:
/\_/\
>^,^<
 / \
(|_|)_/
"""
cat = '/\_/\\\n>^,^<\n / \\\n(|_|)_/\n'
print(cat)
