"""
02_02_C
Программа получает на вход строку и ваша задача вывести первые 4 символа этой строки
Гарантируется, что вводится будет строка длиной не менее 4 символов
Sample Input:
Макгрегор
Sample Output:
Макг
"""

phrase = input()
print(phrase[:4])
