"""
02_02_B
Программа получает на вход строку и ваша задача вывести последний символ этой строки

Sample Input 1:
Сплин
Sample Output 1:
н
"""
phrase = input()
print(phrase[-1])
