"""
02_02_A
Программа получает на вход строку и ваша задача вывести первый элемент данной строки

Sample Input 1:
Zemfira
Sample Output 1:
Z
"""
phrase = input()
print(phrase[0])
