"""
02_02_E
Программа получает на вход строку. Ваша задача вывести все
символы этой строки, которые имеют четные индексы

Sample Input:
Монти Пайтон
Sample Output:
МниПйо
"""
phrase = input()
print(phrase[::2])
